"""
简单的介绍一波mongodb数据库
"""

"""
为什么学习数据库:
1.课程需要：数据入库

2.优势
"""

"""
数据库的介绍：
    作用：保存数据的 
    本质：也是一个特殊的文件
    优势：文本文本txt也可以保存数据
        --1.10w人 李** 男  18 工作状态 ****
            数据库提取方便，命令语句(相当于代码) 可以利用命令语句快速找到符合条件的数据
        --2.方便多台机器操作 
            A 文本文件txt   B
            数据库部署到云服务器上面，方便多台机器查询数据库里面的数据
        --3.读取速度快
        
数据库的分类：
1.关系型数据库
    --oracle mysql

2.非关系型数据库
    --redis mongdb     scrapy-redis分布式爬虫


mongodb安装好以后，记得修改环境变量
安装第三方库以及添加变量如果还有不会的，去钉钉群里下载教程看！！
"""