# 爬虫(网页蜘蛛，网络机器人)
# 重点：

# 爬虫的本质
# 就是模拟客户端(正常的用户),发送网络请求，获取对应的响应数据

# 能够使用爬虫获取(爬取)的数据
# 理论上说，只要是正常用户能够看到的，能够接触到的数据，我们都是可以抓取到的
# 可见皆可爬

# 爬虫难点一:是否能够成功地抓取到数据
# 反爬，根据数据重要性，反爬强度不一

# 爬虫：模拟客户端(正常的用户),发送网络请求  给 服务端
# 服务端(后端)  > 反爬：识别爬虫，然后禁止爬虫访问
# 为什么服务端要做反爬
# 1.保护数据，价格相关的，沃尔玛
# 2.网站后端 部署在云服务器上面，网站就有并发量的问题，千万级的并发量
#    防止网络攻击
# 阿里云 全国各地 的机房(云服务器)  双十一这天


# 反反爬：爬虫程序
# 3秒钟方法别人一百次，封禁你，不允许再继续访问
# 换脸  变脸 A A1 A2 A3 -- A100




# 模拟客户端(正常的用户),发送网络请求，获取对应的响应数据


# 爱奇艺VIP视频
# 正常的用户 登录 充值，变成尊贵的VIP用户  观看VIP视频
# 爬虫  抓取视频数据 保存到本地

# 庆余年
# 百度 BAT
# 百度 >> 爬虫 巨头

# 百度网盘破解






# 没有明文法律规定爬虫是违法的

# 沃尔玛
# 小本本 去超市里面 最早的数据搜集师  > 人工爬虫
# 抓取沃尔玛商品价格 >> 效率高


# 爬虫不是黑客,而是合法全民




# 爬虫 >> 数据收集 >> 被利用自身的盈利，或者说损害到别人利益 触及到违法行为


# 携程 >> 爬虫
# 携程这个抢票，也是利用了爬虫来盈利

# 40 不说是票钱  保险费 加速包 服务费  法律意识极强，我们没有利用爬虫收费，我们收取的是服务费