"""
演示网络请求的发送和响应的接收
"""

# 通过浏览器去访问一些网站
# 谷歌浏览器 QQ UC 搜狗

"""
1.电脑上  通过谷歌浏览器 
输入网址url  www.baidu.com    发送给了DNS服务器

2.DNS服务器是啥
网络海洋中，怎么标记一台特定的电脑，服务器
GPS > 经纬度   北纬10度  西经100度 
IP地址 举例百度服务器(11.11.11.11)
我们平时使用的是www.baidu.com的域名去访问百度

点外卖 北纬10度  西经100度 
       阳光小区 A栋908
       
给机器看的IP  11.11.11.11
给人看的域名  www.baidu.com   域名url

DNS作用：www.baidu.com    >>  11.11.11.11
通过域名解析出对应的IP地址

DNS服务器通过我们输入的域名解析出IP地址

3.拿着IP地址11.11.11.11  百度首页的服务器(仓库)


4.返回给咱们一些数据
html + js + css + jpg
组成了我们看到的网页


html   文字样式
js     事件  点击事件 鼠标的点击  鼠标的滑动  鼠标的停止 
css  渲染工具 控制文字的大小颜色  控制图片的形状等等
jpg png
"""